backend/app/controllers/messages_controller.rb

INSERT INTO "messages" ("text", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "hi"], ["conversation_id", 4], ["created_at", "2021-01-27 04:31:27.678561"], ["updated_at", "2021-01-27 04:31:27.678561"]]
---
  def create
    message = Message.new(message_params)
    if message.save